// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

Console.Write("Enter a number: ");
int max = Convert.ToInt32(Console.ReadLine());
Console.Write("Enter a number: ");
int number2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Enter a number: ");
int number3 = Convert.ToInt32(Console.ReadLine());

if (max < number2)
{
    
}